// Упражнение 1.7. Напишите программу, печатающую значение EOF.

#include <stdio.h>

int main(void)
{

    printf("%d %c\n",EOF,EOF );
    // -1 ▒

    return 0;
}